test/fixture/paos/DIDAuthenticateEAC2_template.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Header>
      <sb:Correlation xmlns:sb="http://urn:liberty:sb:2003-08" messageID="Id520" refToMessageID="86ad52c0-7c06-4b8d-be72-7a559e62aee7"/>
   </soap:Header>
   <soap:Body>
   <DIDAuthenticate xmlns="urn:iso:std:iso-iec:24727:tech:schema">
<ConnectionHandle xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ConnectionHandle">
<ContextHandle>4549445F4946445F434F4E544558545F42415345</ContextHandle>
<IFDName>REINER SCT cyberJack RFID komfort USB 52</IFDName>
<SlotIndex>0</SlotIndex>
<CardApplication>4549445F49534F5F32343732375F42415345</CardApplication>
<SlotHandle>34366364653038392D623031322D346664372D386233362D343664346232393537636236</SlotHandle>
<RecognitionInfo/>
</ConnectionHandle>
   <!-- DIDNAME -->
<AuthenticationProtocolData Protocol="urn:oid:1.3.162.15480.3.0.14.2" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="EAC2InputType">
<Certificates xmlns="unknownNamespace"/>
   <!-- PLACEHOLDER -->
</AuthenticationProtocolData>
</DIDAuthenticate>
</soap:Body>
</soap:Envelope>
